{
    "version": "https://jsonfeed.org/version/1",
    "title": "Madsky",
    "description": "",
    "home_page_url": "https://madsky.github.io",
    "feed_url": "https://madsky.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Leigh"
    },
    "items": [
        {
            "id": "https://madsky.github.io/2025-in-review.html",
            "url": "https://madsky.github.io/2025-in-review.html",
            "title": "2025 In Review",
            "summary": "Favourite Releases of 2025 1. Dimsc没a - Dust Eater This EP was a revelation. An immediate entry into my favourite records of all time. It was the announcement that Dimsc没a would be a last minute addition to the line up of Damnation Festival that actually&hellip;",
            "content_html": "<h1>Favourite Releases of 2025</h1>\n<p>1. Dimsc没a - Dust Eater</p>\n<p>This EP was a revelation. An immediate entry into my favourite records of all time. It was the announcement that Dimsc没a would be a last minute addition to the line up of Damnation Festival that actually tipped me over into buying a ticket.</p>\n<p>From the outset this EP tears it up. Visceral, brooding, and articulate. The EP itself is about the worst kind of loss - the loss of one band member's daughter, specifically. I wouldn't know how to begin to put something of that magnitude into music, at least in part through fear that I wouldn't be able to do it justice. No danger here. The record is an emotional bomb that continues to detonate every time I hear it again.</p>\n<p>It soars, but never preens; it mourns, but never wallows; it imposes, but doesn't outstay its welcome.</p>\n<p>Absolutely masterful from the sparse opening through to the brutal riffing, passing through introspective interludes, only to return to remind you that whilst it might be beautiful, it's meant to hurt.</p>\n<blockquote>\n<p>I did my best, it's all I have</p>\n</blockquote>\n<p>I'm not crying. <em>You're</em> crying.</p>\n<p>2. Deafheaven - Lonely People With Power</p>\n<p>I've been waiting for this record because I saw this as my redemption record for my relationship with Deafheaven. As I've previously written, I had these guys pigeon-holed as \"ok metal\", which I lamented. This was a new release upon which I could jump and go full fanboy.</p>\n<p>And that I did with this record being my most played record of 2025 according to Apple Music (and that's not taking into account the fact that I have it on vinyl too, which gets a decent number of spins).</p>\n<p>Having spent some time with their back catalogue this year too, this record feels like it pulls together all of the best ideas from a career, learns from them, and delivers a whole greater than the sum of its parts. This has the tenderness of Infinite Granite, the ruthless energy of Sunbather, mixed with the aggression and vision of New Bermuda and Ordinary Corrupt Human Love.</p>\n<p>If I had to pick a single stand-out track it would have to Amethyst. Just wow.</p>\n<p>3. Harifa - As The Pale Suns Fades</p>\n<p>I think I found Harifa when doom-scrolling social media. So not everything that comes from social media is bad (although most of it is, to be fair).</p>\n<p>I love this record.</p>\n<p>It's what I think of when I think of Black Metal. I know there's a world of different sounds and styles within this genre but this feels like the perfect intersection of beautiful clean passages with the contrasting heaviness, and the stunning vocals.</p>\n<p>4. Cwfen - Sorrows</p>\n<p>Another social media find, this time slightly different. More towards a goth-tinged doom record. It's got riffs, it's got growls, it's got brooding, and it's got gorgeous clean vocals. It feels like a siren call into a scene I've never really embraced, save for a few fringe skirmishes into the likes of Type O Negative, and maybe some ealier Lacuna Coil.</p>\n<p>I don't know. Different, but engrossing. Simple on its face, but hiding a depth that rewards scratching the surface time and again.</p>\n<p>I also have a signed vinyl of it which makes me very happy.</p>\n<p>5. Lacuna Coil - Sleepless Empire</p>\n<p>I've written about this one earlier in the year. I still love this record. There's still hints of pop-sensibility in here, but they're somehow working to compliment the overall sound and direction rather than scratching like nails down a blackboard as they fight for prominence.</p>\n<p>The first time I've really had any real level of replayability in a Lacuna Coil record since the magnificent Comalies. A long time coming then, and grateful it's here. Looking forward to more from them with this renewed energy and vision.</p>\n<p></p>\n<h1>Favourite Gigs of 2025</h1>\n<p>1. Damnation Festival</p>\n<p>I was half-in and half-out on this festival. Firstly Deafheaven were playing and they were a bucketlist band, so I really wanted to go. But it was also a 2 day festival with mostly bands I didn't know a great deal about so it seemed a big (time) investment to just see Deafheaven, particularly since they're seemingly touring a lot anyway and I could see them in their own right another time.</p>\n<p>This all changed when Dimsc没a were announced as a last minute replacement. Their inaugural record, Dust Eater, had so overwhelmed me with its majesty that within a few minutes of hearing from a mate that they were playing Damnation too, I had tickets.</p>\n<p>And I'm glad I did.</p>\n<p>Dimsc没a was a monumental performance, every bit as powerful and accomplished as the record. Massively emotional set with a well-deserved warm welcome.</p>\n<p>Deafheaven were amazing. Absoutely crushed it. The crowd lapping up an energetic set list that touched on all the right parts of their discography.</p>\n<p>Beyond my main reasons to be there, the other standouts were Oryx, who made a phenomenal racket, Amenra who lived up to all the hype around them, Author and Punisher who managed to deliver a sonically indescribable masterpiece of a set the likes of which I've never seen or heard, and Afsky who put on a flawless black metal set that was transcendent. They're going to feature heavily in my 2026 rotation I think.</p>\n<p>2. Opeth</p>\n<p>I wrote about this one already, so just to call out: the band were tight and on-point and the Albert Hall in Manchester is acoustically beautiful.</p>\n<p>This was a great gig setlist too: something from everywhere with<span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> some new material thrown in. Not indulgent, not trying for full marks on a purity test. Just a great selection of tracks, played with energy and pride. Awesome.</span></p>\n<p>3. Lacuna Coil</p>\n<p>Also written about this one. Stands out for me as shockingly the first time I ever saw a band who've had an album (Comalies) in heavy rotation for what feels like forever. Tight, fun, powerful, inspirational.</p>\n<p>4. Paradise Lost</p>\n<p>I went to see Paradise Lost on their opening night of their tour which was in New Century House in Manchester. Turns out that's a great venue as well with very well-balanced sound. I'm too old for the pit so I stood at a respectable distance and got to see a band who looked like they were loving taking us on a walk down memory lane, touching on all of their styles and sounds.</p>\n<p>I was particularly happy to hear some tracks from One Second - a long-standing favourite record of mine - as well as getting to hear some of the new material at proper volume.</p>\n<p>Excited for next year when Paradise Lost and Katatonia play with Opeth at the Piece Hall in Halifax. What a line-up that one is!</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Live Music",
                   "Album Review"
            ],
            "date_published": "2025-12-23T14:37:15+00:00",
            "date_modified": "2025-12-24T20:58:33+00:00"
        },
        {
            "id": "https://madsky.github.io/deafheaven-sunbather.html",
            "url": "https://madsky.github.io/deafheaven-sunbather.html",
            "title": "Deafheaven - Sunbather",
            "summary": "This is an old record dating back to 2013. I'd been only loosely aware of Deafheaven and although they'd come with a recommendation, I hadn't really put the time in. I liked this record when I listened to it, but I'd - incorrectly, as it&hellip;",
            "content_html": "<p>This is an old record dating back to 2013. I'd been only loosely aware of Deafheaven and although they'd come with a recommendation, I hadn't really put the time in. I liked this record when I listened to it, but I'd - incorrectly, as it turns out - filed it away under \"ok metal\".</p>\n<p>I bought the 10 year vinyl re-issue. And as we know, vinyl means I'm listening properly and not \"grazing\" it, and good lord has this record took on a new level now I've given it the time it deserved.</p>\n<p>On the face of it, I can imagine its pretty rare to have metal music referred to as \"beautiful\" but I'm pretty sure I've done that before. And then there's black metal, which is like another level of intensity added in what would ostensibly appear to be a further move away from \"beautiful\". But again, I'm sure I've done that too.</p>\n<p>But this is \"blackgaze\". A mix of black metal and shoegaze. \"Surely we're going too far!\" I hear you cry. But we're not - trust me, we're not.</p>\n<p>This album is an emotional rollercoaster once you tune in to it.</p>\n<p>It's layed out as a rollercoaster too. Heavy track, then interlude, then heavy track, etc.</p>\n<p>There is texture within the heavy tracks, it's not just wall of sound. But it is also wall of sound. And an incredible noise it is too.</p>\n<p>The appeal of shoegaze is in the tones and noises they manage to build. This appeals to the pedal geek in me because I want so very badly to make my obscene collection of pedals make a nice noise.</p>\n<p>The appeal of black metal is the brutal simplicity and the emergent beauty from the cacaphony.</p>\n<p>The lyrics explore some harrowing experiences and memories. And they do them justice.</p>\n<p>Put it all together with their incredible musicianship and you can either sit and enjoy the rollercoaster, or you can get lost in the textures, stories, and the anguish. The more you listen to it, the more it errs towards the latter and you slowly start to realise quite how astonishing a record this really is.</p>\n<p></p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Album Review"
            ],
            "date_published": "2025-03-25T18:46:01+00:00",
            "date_modified": "2025-12-23T15:15:04+00:00"
        },
        {
            "id": "https://madsky.github.io/live-gig-review-opeth-at-the-albert-hall-manchester.html",
            "url": "https://madsky.github.io/live-gig-review-opeth-at-the-albert-hall-manchester.html",
            "title": "Live Gig Review: Opeth at The Albert Hall, Manchester",
            "summary": "My history of Opeth gigs is not great. Thinking back to when I was a dumbass kid I had a ticket to what would probably have been their Ghost Reveries tour but one of our mates didn't have a ticket and couldn't afford the tout&hellip;",
            "content_html": "<p>My history of Opeth gigs is not great.</p>\n<p>Thinking back to when I was a dumbass kid I had a ticket to what would probably have been their Ghost Reveries tour but one of our mates didn't have a ticket and couldn't afford the tout prices, so we all ended up selling our tickets to the touts and going to the pub instead.</p>\n<p>Some years later we went to see them on some kind of \"prog nation\" (?) gig with a bunch of other prog bands. Whilst we made it to this gig, sadly Mikael's health didn't and he explained he'd been ill which resulted in (a much appreciated but) very muted performance. My main memory of that gig was Dream Theater and my friend's comment, \"I'm not sure if there are too many notes, or not enough time!\".</p>\n<p>So anyway, back to last week.</p>\n<p>I've never been to a gig at The Albert Hall before and I have to say the acoustics in there we phenomenal. It's a huge chapel with loads of preserved original features. We ended up sat effectively behind the band which I was initially a bit upset about. I was convinced this was going to sound awful but my fears were misplaced.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://madsky.github.io/media/posts/19/IMG_1396.jpeg\" alt=\"Opeth on stage at The Albert Hall in front of a big crowd\" width=\"4032\" height=\"3024\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://madsky.github.io/media/posts/19/responsive/IMG_1396-xs.jpeg 300w ,https://madsky.github.io/media/posts/19/responsive/IMG_1396-sm.jpeg 480w ,https://madsky.github.io/media/posts/19/responsive/IMG_1396-md.jpeg 768w ,https://madsky.github.io/media/posts/19/responsive/IMG_1396-lg.jpeg 1024w ,https://madsky.github.io/media/posts/19/responsive/IMG_1396-xl.jpeg 1360w ,https://madsky.github.io/media/posts/19/responsive/IMG_1396-2xl.jpeg 1600w\"><figcaption>Opeth, Albert Hall Manchester, 2025</figcaption></figure>\n<p>Instead, the sound was perfect. Big, crisp, defined, and powerful. And what's more, I was sat only a few metres away from these legends watching from a really unique and interesting angle.</p>\n<p>And Opeth absolutely smashed it.</p>\n<p>I've been a bit cold on Opeth for a while now, not really enjoying their gentler, proggy, jazzy phase. Their previous 2 albums I found to be a bit impenetratable. The return of the death growls for their most recent album, <a href=\"https://music.apple.com/gb/album/the-last-will-and-testament/1770619023\" target=\"_blank\" rel=\"noopener noreferrer\">Last Will and Testament</a>, piqued my interest again and so I thought I'd give it a go.</p>\n<p>Now, as it happens, I hadn't gelled with Last Will either. Not really sure why, but my experience of it was that it was a bit \"flat\" and, if I'm honest, proggy, jazzy, impenetrable - albeit with death growls again.</p>\n<p>So I was absolutely overjoyed to hear them play an amazing selection from their career including tracks from as far back as 1996 (The Night and the Silent Water, Morningrise), through 2001's (incredible) Blakwater Park, 2002's Deliverance, 2005's Ghost Reveries, all the way through to today. And this was all inter-mixed with a bunch of their new material in what turned out to be an awesome <a href=\"https://www.setlist.fm/setlist/opeth/2025/albert-hall-manchester-england-13553545.html\" target=\"_blank\" rel=\"noopener noreferrer\">set-list</a>.</p>\n<p>The band looked like they were having a lot of fun, and Mikael just seems really comfortable doing his thing, He's a funny man and can work a crowd with or without music.</p>\n<p>As much as I loved the nostalgic tour of some old classics - The Leper Affinity in particular was exquisite - my main takeaway was that I actually quite like Last Will now, having heard half of it live, and I even enjoyed some of the stuff from their proggy, jazzy, impenetrable phase. Sorceress, in particular had never really moved me until this gig.</p>\n<p>So, it turns out, music is a bit like bacteria - it just keeps multiplying. Not only do I now need to deep dive back through Opeth's catalogue just because it reminded me of how awesome they were, but I also need to revisit the albums I've previously passed over, and I need to spend a bunch of time with Last Will and Testament.</p>\n<p>I really like how I have an uncanny knack of making things I want to do sound like chores too. My therapist has a lot of work to do.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Live Music"
            ],
            "date_published": "2025-03-08T11:07:37+00:00",
            "date_modified": "2025-03-08T11:07:37+00:00"
        },
        {
            "id": "https://madsky.github.io/firstlisten-bioluminescence-by-dawn-of-ouroboros.html",
            "url": "https://madsky.github.io/firstlisten-bioluminescence-by-dawn-of-ouroboros.html",
            "title": "#FirstListen Bioluminescence by Dawn of Ouroboros",
            "summary": "Found this gem via Prosthetic Records on Instagram. I'm a sucker for a decent metal that includes a strong female vocal. I think of it like textures that can be deployed in the songwriting and this is a perfect example of it. It's got that&hellip;",
            "content_html": "<p>Found this gem via Prosthetic Records on Instagram. I'm a sucker for a decent metal that includes a strong female vocal. I think of it like textures that can be deployed in the songwriting and this is a perfect example of it. It's got that chiaroscuro layered throughout it - at times gentle and comforting (both vocals and music), at others as brutal as you like.</p>\n<p>It's the weave that makes all the difference. It's easy to get it wrong and the whole thing can sound disjointed and cynical. I've heard a bunch of those bands over the years. But this group nails the mix, moving between styles and sounds in a really organic (ぎ) and accomplished way.</p>\n<p>It looks like they've got a bit to chew through so I'm going to dive into their back catalogue.</p>\n<p>I see that they're tagged as \"prog\", but I'm going to pretend I don't read that because the problem with prog is that it eventually \"progresses\" beyond where I'm interested. A selfish worldview, for sure, but this is my blog and you're not the boss of me.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Album Review"
            ],
            "date_published": "2025-03-08T10:26:26+00:00",
            "date_modified": "2025-03-08T10:33:01+00:00"
        },
        {
            "id": "https://madsky.github.io/firstlisten-sleepless-empire-by-lacuna-coil.html",
            "url": "https://madsky.github.io/firstlisten-sleepless-empire-by-lacuna-coil.html",
            "title": "#FirstListen Sleepless Empire by Lacuna Coil",
            "summary": "I've been looking forward to hearing their 10th album since I saw them live last year. I listened to the pre-release songs and was excited for where it was going. I've also been watching their hype on socials around filming for the release. I tend&hellip;",
            "content_html": "<p>I've been looking forward to hearing their 10th album since I saw them live last year. I listened to the pre-release songs and was excited for where it was going. I've also been watching their hype on socials around filming for the release.</p>\n<p>I tend to only graze pre-release singles because I feel like they're lacking the context of the album. I imagine it's a tricky game to pick your pre-release too - you want something that you consider to be one of the better tracks so you can showcase what you've done, but you don't want to release your<em>best</em> tracks because it should only be whetting the appetite.</p>\n<p>Without the full album wrapper it feels lost to me, and so I wait.</p>\n<p>Yesterday I gave this its first full spin. Admittedly in the car with other people, so it didn't have my full attention. But my day hadn't allowed a gap to listen properly and I wasn't going to not play it on release date!</p>\n<p>My very high level first pass is that this is going to be awesome.</p>\n<p>Christina's vocals are on point - as are Andrea's new heavier death growls that we got to enjoy on Comalies XX. The compositions sound interesting - soaring sections, brutal passages, and strong interplay. The mix sounds fuller with more presence from the guitars and rhythm section. It feels like they're back to courting a more alt/metal fanbase whereas some of their previous outtings felt like they were aimed at people with more of a pop sensibility in their structures.</p>\n<p>I have the vinyl on order from my local record shop so I'm looking forward to a more detailed listen once that pops up, but in the meantime this is a record I'll be spending a bunch of time with. I'm sincerely hoping that this has a reception similar to, or better than, Comalies had for them back in 2002.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Album Review"
            ],
            "date_published": "2025-02-15T10:26:20+00:00",
            "date_modified": "2025-02-15T10:26:20+00:00"
        },
        {
            "id": "https://madsky.github.io/link-blog-why-blog-if-nobody-reads-it.html",
            "url": "https://madsky.github.io/link-blog-why-blog-if-nobody-reads-it.html",
            "title": "Link Blog: Why Blog If Nobody Reads It",
            "summary": "Link: https://andysblog.uk/why-blog-if-nobody-reads-it/ I'm under no illusion that I have no audience here. I don't even go to the \"trouble\" of putting a tracker on any of the pages. I don't invite comments or interaction. So why do I do it? The linked article is an&hellip;",
            "content_html": "<p>Link: <a href=\"https://andysblog.uk/why-blog-if-nobody-reads-it/\">https://andysblog.uk/why-blog-if-nobody-reads-it/</a></p>\n<p>I'm under no illusion that I have no audience here. I don't even go to the \"trouble\" of putting a tracker on any of the pages. I don't invite comments or interaction. So why do I do it? The linked article is an excellent summary of a lot of the reasons.</p>\n<p>A long, long time ago I used to blog little technical solutions I'd found and I had trackers on the blog. There was a pretty constant but very low stream of people coming to my blog from search engines because I had solved the exact problem they had.</p>\n<p>This trickle of people didn't make any dfference to my life - I was blogging anyway, and these were just by-products of my writing down my tech solutions and insights.</p>\n<p>One day, much later, I wrote up my reverse engineering of some malware and that got some serious traffic. It does still get consistent traffic today for some reason. But you know what? It changed nothing in my life.</p>\n<p>I also wrote something about \"identity theft\" and submitted it to HackerNews - it went to the front page. It received an obscene amount of traffic and a good set of interactions. But you know what? It changed nothing in my life.</p>\n<p>I then went through a period of self hosting where I blogged quite a lot about my interests but I lost most of the content in my endless shuffling of platforms. During this period I also stopped adding trackers to my blogs. I can't remember if there was a \"why\", I just stopped.</p>\n<p>And I still blog. I do it \"blindly\" to whether it's consumed or not. Occasionally someone I know mentions that they've seen somedthing I've written (not entirely sure how or why since I don't promote it) and we talk about it. But you know what? It changed nothing in my life.</p>\n<p>I still blog. Maybe a bit less than I want to, but I still do it. In a subtle way, removing the tracker code turned out to be a poignant moment - it's when I (possibly without planning) switched from external validation of my efforts to write stuff (clicks, reads, viewers) to internal validation (\"I wrote it because I wanted to\").</p>\n<p><em>(One thing I remember is that I briefly considered chucking my talking points into an LLM so that I could make sure \"I\" was churning out as much \"content\" as possible. What hubris! And what a close call with adding to the cancer of the modern internet.)</em></p>\n<p>That internal validation is a much cleaner way of living; it changes the pace of what I'm doing. If I don't blog, fine. If I do blog, fine. Is it poorly written? Fine. Is it so beautifully written that it's going to get me plaudits? Yeah, sure it is. But I wrote it and the act of writing - as the linked blog says -</p>\n<blockquote>\n<p>When you write, you think better. When you think better, you create better.</p>\n</blockquote>\n<p>Like and subscribe for more.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "LinkBlog",
                   "Life"
            ],
            "date_published": "2025-02-10T08:55:47+00:00",
            "date_modified": "2025-02-10T08:55:47+00:00"
        },
        {
            "id": "https://madsky.github.io/the-audacity-of-sales-people.html",
            "url": "https://madsky.github.io/the-audacity-of-sales-people.html",
            "title": "The Audacity of Sales People",
            "summary": "I'm getting tired of the Sales Grift. It is usually cold-contact, but it's also from people that I already have relationships with. And it usually boils down to this: would you mind doing my job for me? What do I mean by this? Let's look&hellip;",
            "content_html": "<p>I'm getting tired of the Sales Grift. It is usually cold-contact, but it's also from people that I already have relationships with. And it usually boils down to this: <em>would you mind doing my job for me?</em></p>\n<p>What do I mean by this?</p>\n<p>Let's look at the cold-contact scenario, wherein I don't have a relationship with this person. They've usually bought my phone number from some scummy aggregator (spoiler: we will never do business in this scenario), or messaged me on Linked In.</p>\n<blockquote>\n<p>Them: this is our super amazing product ... can we arrange a demo?</p>\n<p>Me: sorry, this isn't in my remit/isn't a priority now/isn't interesting to me</p>\n<p>Them: who can I speak to then?</p>\n</blockquote>\n<p>Now usually I end the conversation there and we'll never talk again. But I've tried to be less angry and short with people over the past few months because I feel it making me calloused in real life and so, sometimes, if I think there's a possibility that this product or service might actually be interesting to someone else I might suggest they contact them on Linked In to let them decide. This has proven to always be a mistake.</p>\n<blockquote>\n<p>Me: you could contact John Smith/Jane Doe</p>\n<p>Them: can you give me their email address and phone number?</p>\n<p>Me: No, use Linked In</p>\n<p>Them: Ok, can you contact them and ask them to reply/say how much you recommend us?</p>\n</blockquote>\n<p>And here we arrive at my point: I am now to make a sales pitch on your behalf, for a product I don't want, to someone you don't know. I'm now here to do your job. You've cold-recruited me to do your job for you.</p>\n<p>And a little later on...</p>\n<blockquote>\n<p>Them: I didn't hear back from John Smith/Jane Doe, could you follow up with them for me? / Could the 3 of us jump on a quick intro call?</p>\n</blockquote>\n<p>I do not work for you and I am not interested in selling your product. When you get to this point in the conversation with me you've now made an enemy of me, and you've made it so that even if you did happen to turn up one day selling the exact thing I needed, we're still not talking.</p>\n<p>The next scenario is found where I'm actively engaging suppliers and we're already in conversations about their products. I've been really clear that we're interested, we've talked about the problem that I want to solve and we've talked about how I think their product or service might help me.</p>\n<p>As this conversation develops, in nearly all recent cases involving US-based firms, we get to the point where they're having me dictate their sales deck to them so that they can send it to me as some kind of leverage.</p>\n<blockquote>\n<p>Them: and what would you say is the main reason you want our product?</p>\n<p>Them: and what else is important to you about our product?</p>\n<p>Them: and what would be the consequence of not getting our product?</p>\n</blockquote>\n<p>I see what you're doing. It's the establishment of the business case for their product, by me, in my own words, and the subtle replacement of my business case to solve my problem, with this one I just created. And because I had a hand in creating it, it's much more important to me than if it were just sent to me (\"The Ikea effect\"). So if I'm not on-guard, wise to - and bored of - this approach you'll catch me out and I'll be singing your company song by the end of the week.</p>\n<p>So again we're at the point where I'm doing your work for you. I'm writing your business case for my buying your product.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Work",
                   "Tech"
            ],
            "date_published": "2025-02-09T11:21:36+00:00",
            "date_modified": "2025-02-09T11:21:36+00:00"
        },
        {
            "id": "https://madsky.github.io/thought-of-the-day-audit.html",
            "url": "https://madsky.github.io/thought-of-the-day-audit.html",
            "title": "Thought of the Day: Audit",
            "summary": "Frustrated practitioner who can't get anything delivered? Tired of the every day realities of time, budget, and feasibility? Have you considered a career in audit instead?",
            "content_html": "<p>Frustrated practitioner who can't get anything delivered? Tired of the every day realities of time, budget, and feasibility?<br><br>Have you considered a career in audit instead?</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Work"
            ],
            "date_published": "2025-02-07T18:28:04+00:00",
            "date_modified": "2025-02-07T18:28:04+00:00"
        },
        {
            "id": "https://madsky.github.io/link-blog-reforms-poll-lead-changes-nothing-for-labour.html",
            "url": "https://madsky.github.io/link-blog-reforms-poll-lead-changes-nothing-for-labour.html",
            "title": "Link Blog: Reform&#x27;s Poll Lead Changes Nothing for Labour",
            "summary": "Link: https://www.theneweuropean.co.uk/reforms-poll-lead-changes-nothing-for-labour/ Farage isn't a serious politician. He's a contrarian rabble-rouser. Remember when he \"won\" the Brexit vote and then disappeared into the shadows to let the grown-ups deal with the fall out? He's good at causing controversy and getting headlines, but there are no&hellip;",
            "content_html": "<p>Link: <a href=\"https://www.theneweuropean.co.uk/reforms-poll-lead-changes-nothing-for-labour/\">https://www.theneweuropean.co.uk/reforms-poll-lead-changes-nothing-for-labour/</a></p>\n<p>Farage isn't a serious politician. He's a contrarian rabble-rouser. Remember when he \"won\" the Brexit vote and then disappeared into the shadows to let the grown-ups deal with the fall out? He's good at causing controversy and getting headlines, but there are no real ideas behind his billowing.</p>\n<p>That said, this is an important moment as the article says. But Labour need to start landing some of the big changes that is possible early in their parliament whilst they have a big majority, instead of upsetting everyone over marginal noise. They're going to get trashed in the right-skewed media either way - they might as well take their lashes whilst making a difference.</p>\n<p>Only by making a difference will they stand a chance of re-election, or, perhaps a bit loftier: of making things better.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "politics",
                   "LinkBlog"
            ],
            "date_published": "2025-02-04T18:13:33+00:00",
            "date_modified": "2025-02-04T18:13:33+00:00"
        },
        {
            "id": "https://madsky.github.io/firstlisten-passages-ep-by-sunrot.html",
            "url": "https://madsky.github.io/firstlisten-passages-ep-by-sunrot.html",
            "title": "#FirstListen: Passages EP by Sunrot",
            "summary": "I can't remember where I found this album. It could be through Apple Music's recommendations or it could be through Instagram. Either way, this was a good pick! Bravo, algorithm! I'm glad my first listen of this was in the man-cave on the stereo because,&hellip;",
            "content_html": "<p>I can't remember where I found this album. It could be through Apple Music's recommendations or it could be through Instagram. Either way, this was a good pick! Bravo, algorithm!</p>\n<p>I'm glad my first listen of this was in the man-cave on the stereo because, as good as Airpods are, I don't think they could have done this one justice.</p>\n<p>Having the walls shake a bit from the wall of terror produced in The First Wound made me sit up and pay a bit more attention. I initially thought I was just getting some more run-of-the-mill doomy noise, but I was wrong.</p>\n<p>I love the vocal mix and tracking. It reminds me of what Absent In Body did with Plague God: it sort of feels like I'm being yelled at by a god. It's massive and charts the perfect course of how I think metal vocals should sound.</p>\n<p>When you arrive at the masterpiece of this EP, Untethered, you immediately know you're in for a treat. The guitars weave out a bleak, sober tapestry before everything kicks in and the bass starts driving the most beautiful, pulsing undercurrent. And to top it off we get the pained screams interplaying with a chanted melody that makes you give it your full attention.</p>\n<p>The opening track, Death Knell, threatened that \"there is no life in the void, only death\" - they then went on to prove over this short EP that there most certainly is life here and whilst it's awash with anguish, there's aching beauty too if you pay close enough attention.</p>\n<p>Looking forward to getting to know this band a lot more.</p>",
            "image": "https://madsky.github.io/media/posts/12/a2095681974_10.jpg",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Album Review"
            ],
            "date_published": "2025-01-25T14:41:35+00:00",
            "date_modified": "2025-01-25T14:43:25+00:00"
        }
    ]
}
