{
    "version": "https://jsonfeed.org/version/1",
    "title": "Madsky",
    "description": "",
    "home_page_url": "https://madsky.github.io",
    "feed_url": "https://madsky.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Leigh"
    },
    "items": [
        {
            "id": "https://madsky.github.io/album-review-absent-in-body-plague-god-2022.html",
            "url": "https://madsky.github.io/album-review-absent-in-body-plague-god-2022.html",
            "title": "Album Review: Absent In Body - Plague God [2022]",
            "summary": "A true stand out from some recent listens. Released in 2022 this record absolutely beasts its way into your ears and takes hold. An astounding noise; powerful, articulate, and terrifying. The quality of this super-group's behemoth is magnificent and the overall sound left me struggling&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://madsky.github.io/media/posts/9/Screenshot-2024-01-08-at-21.19.16.png\" alt=\"Absent In Body, Plague God, Album Cover\" width=\"498\" height=\"765\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://madsky.github.io/media/posts/9/responsive/Screenshot-2024-01-08-at-21.19.16-xs.png 300w ,https://madsky.github.io/media/posts/9/responsive/Screenshot-2024-01-08-at-21.19.16-sm.png 480w ,https://madsky.github.io/media/posts/9/responsive/Screenshot-2024-01-08-at-21.19.16-md.png 768w ,https://madsky.github.io/media/posts/9/responsive/Screenshot-2024-01-08-at-21.19.16-lg.png 1024w ,https://madsky.github.io/media/posts/9/responsive/Screenshot-2024-01-08-at-21.19.16-xl.png 1360w ,https://madsky.github.io/media/posts/9/responsive/Screenshot-2024-01-08-at-21.19.16-2xl.png 1600w\"></figure>\n<p>A true stand out from some recent listens. Released in 2022 this record absolutely beasts its way into your ears and takes hold. An astounding noise; powerful, articulate, and terrifying.</p>\n<p>The quality of this super-group's behemoth is magnificent and the overall sound left me struggling to understand how they'd done it.</p>\n<p>I'll avoid the controversy with one of the people behind this and simply say that you've probably never heard anything like this, and we sadly probably won't again. At least for a while.</p>\n<p>I will be getting hold of a Vinyl copy of this one because it's truly one to be savoured and marvelled at.</p>\n<p>5/5</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Album Review"
            ],
            "date_published": "2024-01-08T21:26:57+00:00",
            "date_modified": "2024-01-08T21:26:57+00:00"
        },
        {
            "id": "https://madsky.github.io/actively-listening-to-music.html",
            "url": "https://madsky.github.io/actively-listening-to-music.html",
            "title": "Actively Listening (to Music)",
            "summary": "The romanticised view of what happened, that I will probably come to adopt, is that I decided I'd listen to more music, decided I'd get into Vinyl, bought a separates system, and now find myself listening to more music. Bravo, me! In reality, I was&hellip;",
            "content_html": "<p>The romanticised view of what happened, that I will probably come to adopt, is that I decided I'd listen to more music, decided I'd get into Vinyl, bought a separates system, and now find myself listening to more music. Bravo, me!</p>\n<p>In reality, I was so invested in the Wayfarer hype train as a result of them putting out two stunning records in succession that I went out and bought them both on Vinyl. This was an odd move considering that I didn't have any means to play Vinyl. And so I decided to look into getting a hi-fi set up of my own. This took many months of research and talking to the local record shop owner. He shared with me his \"pitch\" for why someone should listen to Vinyl on a proper hi-fi set up (he was fully aware of his vested interest in his tale) and it was this: Vinyl forces us to <em>actively</em> listen to the music (because you need to flip the record every 20-or-so minutes) and so you can't really end up <em>grazing</em> the music. The packaging with Vinyl tends to come with a reasonable liner/content that you get yourself fully immersed as you listen.</p>\n<p>I was sold going in. And double sold coming out.</p>\n<p>So, here I am with a reasonable hi-fi but a pretty limited Vinyl collection so far. Now, the reality is that I'm not going to have hundreds of records overnight and exclusively listen to Vinyl since I have Apple Music and access to my whole listening history.</p>\n<p>But I've been able to carve out what I think will prove to be one of the most important parts of this process: the active listening.</p>\n<p>I've started following various reviewers and talking to old friends about music recommendations and have found myself carving out time to listen rather than it just being secondary to something else I'm doing (walking the dog, driving somewhere).</p>\n<p>There's an experiential element to listening on a real hi-fi that isn't there on headphones. I have some reasonable noise-cancelling in-ear headphones which represented a massive step-up from where I was, but listening with speakers, in a dedicated space, with a decent amp just hits different. The combination of the moving air and the fact that I'm there solely to experience this ~hour of music has made it beautiful.</p>\n<p>I've always loved music. I've always listened, but it's become such a passive, mindless activity that I quickly came to realise: I've really missed actively listening to a record.</p>\n<p>Here's to a year of new music and headspace.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Music",
                   "Life"
            ],
            "date_published": "2024-01-08T13:50:00+00:00",
            "date_modified": "2024-01-08T13:59:02+00:00"
        },
        {
            "id": "https://madsky.github.io/mastodon-life-after-twitter.html",
            "url": "https://madsky.github.io/mastodon-life-after-twitter.html",
            "title": "Mastodon - Life After Twitter",
            "summary": "I have spent a lot of time on Twitter, but it's fair to say I never really liked it. In fact, over the years I developed a love/hate relationship with it where I was either over-using it or deleting everything I'd ever done on there.",
            "content_html": "<p>I have spent a lot of time on Twitter, but it's fair to say I never really liked it. In fact, over the years I developed a love/hate relationship with it where I was either over-using it or deleting everything I'd ever done on there.</p>\n<p>In some ways it was useful at times - the infosec community was pretty strong on there, for example - but even as a part of that community twitter always left me feeling like an outsider looking in.</p>\n<p>Most often I found myself doom-scrolling following a world event that had annoyed me. It was at least good for getting breaking news or between-the-lines commentary on things.</p>\n<p>The worst of it was where I would find myself getting annoyed at things that didn't even really affect me. They weren't necessarily even \"bad\" either in my judgement. Just that some group was up against some other group over an issue and the resulting fall-out was polarising and, I guess, exciting.</p>\n<p>When Space Karen took over twitter I was not hopeful. I had been away from the site for some time but the Conservative party hilarity in the UK had brought me back to observe the insanity. However, following the attack on Paul Pelosi and the subsequent \"there may be more to this\" post, I'd had enough. US media is already a shambolic, divisive wasteland and this arsehole wading in with this moronic opinion, from such a position of influence was the last straw for me. And so I deleted my account.</p>\n<p>So where to next?</p>\n<p>There are plenty of other sites and communities vying for a piece of the crumbling twitter empire, but I recalled that I'd signed up a few years previous to a Mastodon community. I figured I could do worse than give that another go.</p>\n<p>In the past, Mastodon had felt like a bit of a ghost town. There were a few people on there, some who posted quite a lot, but overall it felt like a bit of a fringe, hobbyist affair.</p>\n<p>I dusted off my creds and dived back in.</p>\n<p>The whole place was alive! I saw a post recently saying that Mastodon (as a federated series of communities) was now over 8 million people strong. This has been growing steadily over the past few weeks. Certainly compared to the Mastodon community I was a part of a few years back it's a very different beast.</p>\n<p>In a different site I posted that Mastodon felt like a lost internet from the 90s. Interesting, quirky, friendly people going about their business and being nice to each other.</p>\n<p>In a few short weeks I've rediscovered music as a source of joy - through exploring recommendations of others and reading their reviews. I've found that over the Covid lockdown my weird hobby of taking pictures of various types of mushrooms in the wild has its own niche community out there. I've found that the enough of the infosec community have moved over that I can still follow along.</p>\n<p>But most of all I've discovered that the toxicity was a generated feature of twitter, not necessarily of its users. I don't think my interests have changed over the past few months to the point that I'd err towards an entirely different crowd of people. And yet my feed isn't a dumpster fire of hatred and aggression.</p>\n<p>The algorithm on twitter that was curating my feed was doing a cracking job of making sure that I was an old man shouting at clouds. Over things - again - that didn't affect me and that didn't need my ire.</p>\n<p>Mastodon feels experimental - not only as a technology - but also a revitalisation of a means of communicating with other people with civility, grace, and good humour. </p>\n<p>One user posted the following and the brilliance of it took a little while to sink in for me, but really does cut to the crux of the matter:</p>\n<p><a href=\"https://tech.lgbt/@laurakm/109370867899322648\" target=\"_blank\" rel=\"noopener noreferrer\">\"Mastodon has changed how I think. Twitter now seems like a server that doesn't want to federate with anyone else, and that everyone else has blacklisted. I'm in awe of how much sense that makes.\"</a></p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Tech",
                   "Music",
                   "Life"
            ],
            "date_published": "2022-12-03T22:59:42+00:00",
            "date_modified": "2022-12-03T22:59:42+00:00"
        },
        {
            "id": "https://madsky.github.io/creatively-stuck.html",
            "url": "https://madsky.github.io/creatively-stuck.html",
            "title": "Creatively Stuck",
            "summary": "I started a project last year. It's a creative project in my own time that requires writing, music, and artwork. It's a big ask of myself and whilst it was going well to start with, I've seemingly gotten myself stuck and can't find a way&hellip;",
            "content_html": "<p>I started a project last year. It's a creative project in my own time that requires writing, music, and artwork. It's a big ask of myself and whilst it was going well to start with, I've seemingly gotten myself stuck and can't find a way out.</p>\n<p>The story element to this project was written first. And that's more or less done. A couple of people have reviewed it for me and I've tweaked bits and pieces, but it's basically finished.</p>\n<p>The music element of it though - which was always going to be the hardest work - has come to a complete standstill.</p>\n<p>I was well underway with 2 of the tracks (of probably 9 in total) but I lost my creative streak and have found it tough to get back into it. Worse, in the time that it's taken me to come back round to it, I've lost the thread that I was working on and I don't really like what I've done or where it was going anymore.</p>\n<p>And so the music part is more or less back at square one.</p>\n<p>The artwork had a few high level ideas created using an AI, but I haven't really touched that. This part is not a surprise though - I've got the least skill and experience in this stuff so I expected it to be last.</p>\n<p>Why am I stuck with the music though?</p>\n<p>We ran competitions amongst friends during lockdown where we'd take a theme and dedicate a small amount of time to it - usually a week or two weeks. At the end of this period the idea was that you presented what you had. This was a huge motivator because the finite time meant that you couldn't mañana it - it had to be started right now - and the other driver was that there was nowhere near enough time to make it \"perfect\" - you just had to make it \"good enough\".</p>\n<p>I think this is where I've come unstuck with my project. I know that I've got as long as I want because I've no committed external deadline. I also know that I need to make it \"perfect\" - otherwise what's the point.</p>\n<p>And so I find myself creatively stuck. I don't really have the time to spare - particularly not to reach such a high bar (\"perfect\") and so I simply let it lapse.</p>\n<p>It's probably pretty obvious what frustrates me here: it's not the work, it's not even the problem. It's the fact that I know the solution and yet I still procrastinate.</p>\n<p>In a work context we've solved this using Agile sprints and the idea of a Minimum Viable Product (MVP). We've got 2 weeks sprints that set a series of interim deadlines and we've got a built in acceptance that we're not aiming for perfect - MVPs.</p>\n<p>If someone at work came to me with this problem I'd probably say something about \"perfect being the enemy of progress\" and then help them structure what they were doing into the relevant sprints and break it down into achieveable tasks.</p>\n<p>But here I sit with my very own personal version of the same problem and a whole raft of proven solutions that for some reason I can't turn into results.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Work",
                   "Music",
                   "Life"
            ],
            "date_published": "2022-11-27T12:00:53+00:00",
            "date_modified": "2022-11-27T12:00:53+00:00"
        },
        {
            "id": "https://madsky.github.io/my-job-is-context-switching.html",
            "url": "https://madsky.github.io/my-job-is-context-switching.html",
            "title": "&quot;My job is context switching&quot;",
            "summary": "Context switching - jumping between multiple tasks - is one of the things that I seek to protect my teams from. It is pretty commonly derided as a \"productivity killer\" and having been in various jobs that have demanded it I can attest to the&hellip;",
            "content_html": "<p>Context switching - jumping between multiple tasks - is one of the things that I seek to protect my teams from. It is pretty commonly derided as a \"productivity killer\" and having been in various jobs that have demanded it I can attest to the effort that it requires to maintain for too long. And how close to the dreaded \"burn out\" you can get with it.</p>\n<p>But I've recently discovered that my job as a leader is actually all about context switching. And yet I don't feel dangerously close to burning out. What gives?</p>\n<p>I think the difference is the level of detail that we need to engage at. As an architect I was necessarily down in the detail. My job was to understand the detail of what was happening so that I could come up with viable designs, identify key risks, and enable informed decision-making.</p>\n<p>Context switching in detail comes with a huge overhead of having to get back into the detail of each new task. None of it is cursory - it's all detail work. And that process of getting back into the detail is the bit that I think constitutes the \"overhead\". I can't do the work until the overhead is covered - which takes time. So if I have to switch contexts too ofthen then all I'm doing is processing overhead and never making real progress.</p>\n<p>Now though, in my role as a leader, I've had to accept due to the scale of what my teams are involved in, being over all the detail is impossible. This was a difficult adjustment but probably a whole other blog post for another day. So, lacking that detail my need to process the overhead is a function of how well my teams are operating. I don't need the detail because I know that I've got good people who do have it. And one of the key skills that my teams need is being able to summarise their positions when they need support.</p>\n<p>I've switched out detail for context.</p>\n<p>And I think that's what makes the difference to why context switching isn't problematic and is, in fact, my job.</p>\n<p>Provided I've got people that I know are dealing with the detail. And provided I know that they can summarise to me their requirements and situations. And provided that I'm sufficiently aware of the moving parts, I can forgo the detail and context switch without burden.</p>",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "leadership",
                   "Work"
            ],
            "date_published": "2022-11-25T22:31:54+00:00",
            "date_modified": "2022-11-25T22:31:54+00:00"
        },
        {
            "id": "https://madsky.github.io/flexible-working-is-quite-hard.html",
            "url": "https://madsky.github.io/flexible-working-is-quite-hard.html",
            "title": "Flexible Working is Quite Hard",
            "summary": "I love working from home. My commute is lovely. The coffee is consistently excellent and works out at about 17p per cup. My monitor is huge. The guy making my lunch is quite lazy which often results in my eating crisp butties, but I think&hellip;",
            "content_html": "<p>I love working from home. My commute is lovely. The coffee is consistently excellent and works out at about 17p per cup. My monitor is huge. The guy making my lunch is quite lazy which often results in my eating crisp butties, but I think he's distracted with another job so I try to go easy on him.</p>\n<p>The office is far away. Coffee, although subsidised (and pretty decent) is a bit pricier than 17p a cup, and to be honest the monitor situation is a bit hit and miss, despite the heavy investment in a lovely new building. But there is a Juici Sushi and the GLC just round the corner and I don't even think they serve crisp butties.</p>\n<p>I'm lucky that my company have been employee-focused over the past couple of horrific years and they've been incredibly protective of us and shown a huge amount of flexibility.</p>\n<p>I remember our CEO talking early into the COVID nonsense about how he was certain that we needed to be in the office as this was our \"secret sauce\" but then as this looked less and less feasible, we pivoted and adopted a home-first strategy.</p>\n<p>An accident of timing meant that we were leaving a brand-new office basically empty for the most part, but everyone understood that it was the right choice for the time.</p>\n<p>As we've emerged from the worst of COVID there's been a slow return to the office - again on very flexible terms, but it's fair to say that I don't think the uptake has been huge.</p>\n<p>I'm guilty of taking the easy commute option too often. But equally I've been stung a few times when I've arranged to meet people and it has been cancelled at the last minute. My commute isn't cheap (in money or time-elapsed) but is usually worth it to get to spend some real face time with people. It's less beneficial for me to travel the 90 minutes to the office to spend 8 hours on Zoom calls whilst sat alone, and then commute home.</p>\n<p>And herein lies the difficulty - giving people flexibility seems like the obvious and right choice, but the difficultly comes when you're trying to co-ordinate getting groups and teams together. When everyone is flexible then it's hard to make and stick to firm plans.</p>\n<p>There are clear benefits from being together face to face. I wouldn't like to have planned a few of our recent projects entirely remotely, nor would having 'Zoom Beers' have been as intangibly beneficial as sitting outside a pub near the train station in the sun putting the world to rights whilst waiting for the train. </p>\n<p>So what is the answer? Everyone back in the office? Hope that technology somehow continues to improve remote working to the point that it is really like being in each other's company?</p>\n<p>I don't know. </p>\n<p>I'd like to spend time with my teams more often. I'd like to have more team meetings in a real room together. I'd like to solve minor problems over a coffee (or whilst waiting for a coffee) instead of in a Zoom meeting (in mandatory 30 minute increments). I'd like to catch someone whilst passing their desk and realise something obvious that had previously evaded me. Maybe this is what was meant by \"secret sauce\".</p>\n<p>But I also like my home commute, coffee, and crisp-butties. And I love having my dog with me too.</p>\n<p>I don't know. It's quite hard. But it feels like something has to change.</p>",
            "image": "https://madsky.github.io/media/posts/3/IMG_0490.jpeg",
            "author": {
                "name": "Leigh"
            },
            "tags": [
                   "Work",
                   "Life"
            ],
            "date_published": "2022-07-14T18:54:31+01:00",
            "date_modified": "2022-07-14T18:58:45+01:00"
        }
    ]
}
